---
kind: method
id: M:Autodesk.Revit.DB.ExportPatternInfo.Dispose
source: html/0bc5ab44-2027-4852-f4ea-988f91166001.htm
---
# Autodesk.Revit.DB.ExportPatternInfo.Dispose Method

Releases all resources used by the ExportPatternInfo

## Syntax (C#)
```csharp
public void Dispose()
```